In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as sns

In [2]:
%matplotlib inline

In [3]:
data1 = pd.read_csv('kaggled1.csv')

In [4]:
data1.head()

  Product_Supermarket_Identifier  Product_Supermarket_Sales
0              DRA59_CHUKWUDI010                  1467.0317
1              DRA59_CHUKWUDI013                  9107.4100
2              DRB01_CHUKWUDI013                  8542.2510
3              DRB13_CHUKWUDI010                  1485.2194
4              DRB13_CHUKWUDI013                  8646.8530

In [5]:
data2 = pd.read_csv('kaggle1.csv')

In [6]:
data2.head()

  Product_Supermarket_Identifier  Product_Supermarket_Sales
0              DRA59_CHUKWUDI010                  1469.9090
1              DRA59_CHUKWUDI013                  9260.5360
2              DRB01_CHUKWUDI013                  8655.6650
3              DRB13_CHUKWUDI010                  1328.2487
4              DRB13_CHUKWUDI013                  8439.3490

In [7]:
data1['Product_Supermarket_Sales'] =  (data1['Product_Supermarket_Sales'] + data2['Product_Supermarket_Sales'])/2

In [8]:
data1.head()

  Product_Supermarket_Identifier  Product_Supermarket_Sales
0              DRA59_CHUKWUDI010                 1468.47035
1              DRA59_CHUKWUDI013                 9183.97300
2              DRB01_CHUKWUDI013                 8598.95800
3              DRB13_CHUKWUDI010                 1406.73405
4              DRB13_CHUKWUDI013                 8543.10100

In [9]:
data = pd.read_csv('kaggled1.csv')

In [10]:
data1 = pd.read_csv('kaggled4.csv')

In [11]:
data.head()

  Product_Supermarket_Identifier  Product_Supermarket_Sales
0              DRA59_CHUKWUDI010                  1467.0317
1              DRA59_CHUKWUDI013                  9107.4100
2              DRB01_CHUKWUDI013                  8542.2510
3              DRB13_CHUKWUDI010                  1485.2194
4              DRB13_CHUKWUDI013                  8646.8530

In [12]:
data1.head()

  Product_Supermarket_Identifier  Product_Supermarket_Sales
0              DRA59_CHUKWUDI010                  1446.9369
1              DRA59_CHUKWUDI013                  9029.0660
2              DRB01_CHUKWUDI013                  8513.4940
3              DRB13_CHUKWUDI010                  1536.7395
4              DRB13_CHUKWUDI013                  8661.8030

In [13]:
data['Product_Supermarket_Sales'] = (data['Product_Supermarket_Sales'] + data1['Product_Supermarket_Sales'])/2

In [14]:
data.head()

  Product_Supermarket_Identifier  Product_Supermarket_Sales
0              DRA59_CHUKWUDI010                 1456.98430
1              DRA59_CHUKWUDI013                 9068.23800
2              DRB01_CHUKWUDI013                 8527.87250
3              DRB13_CHUKWUDI010                 1510.97945
4              DRB13_CHUKWUDI013                 8654.32800

In [15]:
data['Product_Supermarket_Sales'] = data['Product_Supermarket_Sales'] + 100

In [16]:
data.to_csv('try.csv',index = False)